# Lab2 Python for Data Science 1
----------------------------------

## Task 1

First, convert the list of weights from a list to a Numpy array.  
Then, convert all of the weights from kilograms to pounds. Use the scalar conversion of 2.2 lbs per kilogram to make your conversion.  
Lastly, print the resulting array of weights in pounds.

In [1]:
weight_kg = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

In [ ]:
# import numpy

# Create a numpy array np_weight_kg from weight_kg

In [ ]:
# Create np_weight_lbs from np_weight_kg

# Print out np_weight_lbs

## Task 2

Create a Dataframe from scratch, view the data

In [ ]:
# we have a dictionary of data
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }
# import pandas

# create a dataframe from the dictionary

# print the dataframe

In [ ]:
# Change the index to two-letter contry code
brics.index = ["BR", "RU", "IN", "CH", "SA"]
brics

In [ ]:
#show the first and last two rows

In [ ]:
# describe the data using describe()

In [ ]:
# save the dataframe to a .csv file (e.g. brics.csv)

## Task 3

Read the csv file to a dataframe, then perform data selection.

In [6]:
import pandas as pd

# read the brics.csv file in data folder to a dataframe, 
brics = pd.read_csv('data/brics.csv', index_col = 0)
brics

      area    capital       country  population
BR   8.516   Brasilia        Brazil      200.40
RU  17.100     Moscow        Russia      143.50
IN   3.286  New Dehli         India     1252.00
CH   9.597    Beijing         China     1357.00
SA   1.221   Pretoria  South Africa       52.98

In [7]:
# Print out country column as Pandas Series using "[]"
print(brics['country'])

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [9]:
# Print out 3rd - 5th rows using "[]"
print(brics[2:5])

     area    capital       country  population
IN  3.286  New Dehli         India     1252.00
CH  9.597    Beijing         China     1357.00
SA  1.221   Pretoria  South Africa       52.98

In [11]:
# Print out observation for China and Brazil 
# using Select by Label (.loc)
brics.loc[['BR','CH'],:]

     area   capital country  population
BR  8.516  Brasilia  Brazil       200.4
CH  9.597   Beijing   China      1357.0

In [12]:
# Print out observation for China and Brazil 
# using Select by location (.iloc)
brics.iloc[[0,3],:]

     area   capital country  population
BR  8.516  Brasilia  Brazil       200.4
CH  9.597   Beijing   China      1357.0

In [13]:
# select the rows of countries with more 
# than 200m in population using boolean indexing
brics[brics['population']>200]

     area    capital country  population
BR  8.516   Brasilia  Brazil       200.4
IN  3.286  New Dehli   India      1252.0
CH  9.597    Beijing   China      1357.0

## Task 4

Create two dataframes, join the two data frames based on a key

In [16]:
# Import pandas
import pandas as pd
# create dataframe 1
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [4]:
#create dataframe 2
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'test_id': [51, 15, 15, 61, 16]}
df_b = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_b

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16

In [5]:
# join the two dataframes based on subject_id 
# using merge(df1,df2,on='keyname')
pd.merge(df_a,df_b,on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          5     Ayoung   Atiches       16

## Task 5

Create a dataframe with missing value, then replace the NaN with 0

In [8]:
# import pandas and numpy
import pandas as pd
import numpy as np


# Create a dataframe with missing value
df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])
df = df.reindex(['a', 'b', 'c','d'])
print df

        one       two     three
a -0.710522  0.690986 -0.064349
b       NaN       NaN       NaN
c -0.243240 -1.118316 -1.545730
d       NaN       NaN       NaN

In [9]:
# replace NaN with '0' using fillna(value = ?)
print df.fillna(0)

        one       two     three
a -0.710522  0.690986 -0.064349
b  0.000000  0.000000  0.000000
c -0.243240 -1.118316 -1.545730
d  0.000000  0.000000  0.000000

In [10]:
# exclude missing value using dropna()
df.dropna()

        one       two     three
a -0.710522  0.690986 -0.064349
c -0.243240 -1.118316 -1.545730